Revit 2027 API
IFCParameterTemplate.ExportIFCBaseQuantities Property
 The option to export IFC base quantities for exported Revit elements. If true, then all IFC base quantities not excluded will be exported. If false, then no IFC base quantities will be exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ExportIFCBaseQuantities { get; set; }
Public Property ExportIFCBaseQuantities As Boolean
	Get
	Set
public:
property bool ExportIFCBaseQuantities {
	bool get ();
	void set (bool value);
}
member ExportIFCBaseQuantities : bool with get, set
Property Value
Boolean
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace